<a href="https://colab.research.google.com/github/juri123123/DALC_Scala/blob/main/kmooc3%EC%A3%BC%EC%B0%A8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
3. Pandas로 데이터 가공하기

1) Pandas 설치
    - 서로 다른 유형의 데이터를 공통의 형식으로 정리
    - Series, DataFrame 제공

In [4]:
import numpy as np
import pandas as pd
pandas.__version__

'1.1.5'

In [ ]:
2)pandas 객체
    - Series : 1차원 배열 형태 / 1:1대응
    - DataFrame : 2차원 배열 / 데이터프레임 구조 (여러개의 Series)

In [5]:
#3)Series

data = pd.Series([0.25, 0.5, 0.75, 1])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [7]:
data.values
data.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
data[1]

data[1:3]

1    0.50
2    0.75
dtype: float64

In [11]:
data = pd.Series([0.25, 0.5, 0.75, 1],
        index = ['a', 'b', 'c', 'd'])
data['b']

0.5

In [12]:
data = pd.Series([0.25, 0.5, 0.75, 1],
        index = [2, 5, 3, 7])
data[5]

0.5

In [15]:
population_dict = {'California' : 3888888,
                   'Texas' : 2222222,
                   'New York' : 2342342,
                   'Florida' : 1233455,
                   'Illinois' : 123123123}
population = pd.Series(population_dict)
population['California' : 'Illinois']

California      3888888
Texas           2222222
New York        2342342
Florida         1233455
Illinois      123123123
dtype: int64

In [16]:
#pd.Series(data, index = index) #index생략가능

pd.Series(5, index = [100, 200, 300])

100    5
200    5
300    5
dtype: int64

In [17]:
dic_data = {2:'a', 1:'b', 3:'c'}
dic_data

{1: 'b', 2: 'a', 3: 'c'}

In [18]:
pd.Series({2:'a', 1:'b', 3:'c'}) #입력된 순

2    a
1    b
3    c
dtype: object

In [19]:
pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2])

3    c
2    a
dtype: object

In [21]:
#4)DataFrame : Series 객체의 연속

area_dict = {'California' : 3888888,
                   'Texas' : 2222222,
                   'New York' : 2342342,
                   'Florida' : 1233455,
                   'Illinois' : 123123123}
area = pd.Series(area_dict)
area

California      3888888
Texas           2222222
New York        2342342
Florida         1233455
Illinois      123123123
dtype: int64

In [22]:
states = pd.DataFrame({'population' : population,
                       'area' : area})
states

            population       area
California     3888888    3888888
Texas          2222222    2222222
New York       2342342    2342342
Florida        1233455    1233455
Illinois     123123123  123123123

In [24]:
states.index
states.columns #열 이름

Index(['population', 'area'], dtype='object')

In [25]:
states['area']

California      3888888
Texas           2222222
New York        2342342
Florida         1233455
Illinois      123123123
Name: area, dtype: int64

In [26]:
pd.DataFrame(population, columns=['population'])

            population
California     3888888
Texas          2222222
New York       2342342
Florida        1233455
Illinois     123123123

In [27]:
pd.DataFrame(population, index=['Texas'], columns =["population"])

       population
Texas     2222222

In [28]:
pd.DataFrame([{'a' : 1, 'b':2}, {'b':3, 'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [29]:
pd.DataFrame({'population':population, 'area':area})

            population       area
California     3888888    3888888
Texas          2222222    2222222
New York       2342342    2342342
Florida        1233455    1233455
Illinois     123123123  123123123

In [30]:
pd.DataFrame(np.random.rand(3,2), columns=['foo', 'bar'], index = ['a', 'b', 'c'])

        foo       bar
a  0.803111  0.660524
b  0.094539  0.904403
c  0.345182  0.420258

2!!!!

In [31]:
#1)index 객체 // 불변성

ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [34]:
ind[1]
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [36]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [37]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])
indA & indB #교집합

Int64Index([3, 5, 7], dtype='int64')

In [38]:
indA | indB #합

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [39]:
indA ^ indB #차

Int64Index([1, 2, 9, 11], dtype='int64')

In [ ]:
#2)인덱서

loc vs iloc
인덱스 이름 / 정수형 위치 인덱스
범위 지정 끝 포함 / 범위 끝 제

In [40]:
data = pd.Series([0.25, 0.5, 0.75, 1], index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [41]:
data.loc['a']

0.25

In [42]:
data.loc['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [43]:
data.iloc[1]

0.5

In [44]:
data.iloc[1:3]

b    0.50
c    0.75
dtype: float64

In [46]:
area = pd.Series({'California':11111, 'Texas':22222, 'New York':333333, 'Florida':444444, 'Illinois':55555})
pop = pd.Series({'California':1, 'Texas':2, 'New York':3, 'Florida':4, 'Illinois':5})
data = pd.DataFrame({'area':area, 'pop' : pop})
data

              area  pop
California   11111    1
Texas        22222    2
New York    333333    3
Florida     444444    4
Illinois     55555    5

In [47]:
data['area']

California     11111
Texas          22222
New York      333333
Florida       444444
Illinois       55555
Name: area, dtype: int64

In [48]:
data.area

California     11111
Texas          22222
New York      333333
Florida       444444
Illinois       55555
Name: area, dtype: int64

In [50]:
states['density'] = states['area'] / states['pop']
states

KeyError: ignored

In [51]:
states.values

array([[  3888888,   3888888],
       [  2222222,   2222222],
       [  2342342,   2342342],
       [  1233455,   1233455],
       [123123123, 123123123]])

In [52]:
states.T

            California    Texas  New York  Florida   Illinois
population     3888888  2222222   2342342  1233455  123123123
area           3888888  2222222   2342342  1233455  123123123

In [53]:
states.values[0]

array([3888888, 3888888])

In [54]:
states.iloc[:3, :2]

            population     area
California     3888888  3888888
Texas          2222222  2222222
New York       2342342  2342342

In [55]:
states.loc[:'Illinois', :'pop']

            population
California     3888888
Texas          2222222
New York       2342342
Florida        1233455
Illinois     123123123

In [57]:
student = pd.Series({'국어':96, '영어':90, '수학':80})
p_student = student /100
p_student

국어    0.96
영어    0.90
수학    0.80
dtype: float64

In [58]:
student1 = pd.Series({'국어':96, '영어':90, '수학':80})
student2 = pd.Series({'국어':86, '영어':100, '수학':79})
avg_student = (student1 + student2) / 2
avg_student

국어    91.0
영어    95.0
수학    79.5
dtype: float64

In [61]:
student1 = pd.Series({'국어':96, '영어':90, '수학':80})
student2 = pd.Series({'수학':86, '국어':100, '영어':79})
sum_student = student1 + student2
sum_student

국어    196
수학    166
영어    169
dtype: int64

In [ ]:
#3)연산 메소드

NaN // fill_value = 0

In [62]:
student1 = pd.Series({'국어':96, '영어':90, '수학':80})
student2 = pd.Series({'수학' : 94, '영어':100})
sum_student = student1.add(student2, fill_value = 0)
sum_student

국어     96.0
수학    174.0
영어    190.0
dtype: float64

In [64]:
korean = pd.Series({'s1':96, 's2':80, 's3':96})
english = pd.Series({'s1':94, 's2':100, 's3':96})
math = pd.Series({'s1':90, 's2':83, 's3':92})
score = pd.DataFrame({'kor':korean, 'eng':english, 'mat':math})
score

    kor  eng  mat
s1   96   94   90
s2   80  100   83
s3   96   96   92

In [65]:
score = score / 100
score

     kor   eng   mat
s1  0.96  0.94  0.90
s2  0.80  1.00  0.83
s3  0.96  0.96  0.92

In [66]:
score1 = score + np.random.randint(-10, 10)
score1

     kor   eng   mat
s1  6.96  6.94  6.90
s2  6.80  7.00  6.83
s3  6.96  6.96  6.92

In [69]:
score2 = score + np.random.randint(-10, 10)
score2

     kor   eng   mat
s1  5.96  5.94  5.90
s2  5.80  6.00  5.83
s3  5.96  5.96  5.92

In [70]:
sum_score = score1 + score2
sum_score

      kor    eng    mat
s1  12.92  12.88  12.80
s2  12.60  13.00  12.66
s3  12.92  12.92  12.84

In [71]:
music = pd.Series({'s1':96, 's2':98, 's3':88})
score1['mus'] = music
score1

     kor   eng   mat  mus
s1  6.96  6.94  6.90   96
s2  6.80  7.00  6.83   98
s3  6.96  6.96  6.92   88

In [72]:
sum_score = score1 + score2
sum_score

      eng    kor    mat  mus
s1  12.88  12.92  12.80  NaN
s2  13.00  12.60  12.66  NaN
s3  12.92  12.92  12.84  NaN